In [45]:
import pandas as pd

In [46]:
course_name = ['Data Science','Machine Learning','Big Data','Data Engineer']

In [47]:
duration = [2,3,6,4]

In [48]:
df = pd.DataFrame(data = {'course_name' : course_name,'duration' : duration})

In [49]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [50]:
#Q.1
df[1:2]

        course_name  duration
1  Machine Learning         3

In [51]:
#Q.2
df.loc[0:4,['course_name','duration']]

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [52]:
df.iloc[0:4,[0,1]]

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [57]:
#Q.3
reindex = [3,0,1,2]
new_df = df.reindex(reindex)

In [58]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [59]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [60]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [61]:
#Q.4
import pandas as pd 
import numpy as np 
columns = ['column_1','column_2','column_3','column_4','column_5','column_6']
indices = [1,2,3,4,5,6]
df1 = pd.DataFrame(np.random.rand(6,6),columns = columns , index = indices)

In [65]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.894084  0.257154  0.610930  0.857897  0.853411  0.594533
2  0.253458  0.865296  0.912112  0.486195  0.845067  0.790319
3  0.439221  0.224841  0.756089  0.072683  0.464498  0.963699
4  0.386072  0.257504  0.394907  0.241842  0.652758  0.586305
5  0.122639  0.037992  0.554921  0.399939  0.249230  0.202048
6  0.318772  0.437521  0.045992  0.684985  0.747546  0.465546

In [63]:
df1.mean()

column_1    0.402375
column_2    0.346718
column_3    0.545825
column_4    0.457257
column_5    0.635418
column_6    0.600408
dtype: float64

In [64]:
df1.std()

column_1    0.264885
column_2    0.284012
column_3    0.301764
column_4    0.286634
column_5    0.237782
column_6    0.262739
dtype: float64

In [67]:
#Q.5
df1['column_2'].mean()

0.34671788672648574

In [69]:
#Q.6
df2 = pd.DataFrame({'a':[1,2,3,4,5,6]})
df2

   a
0  1
1  2
2  3
3  4
4  5
5  6

In [70]:
#Q.7
pd.date_range(start = '2023-08-23',end = '2023-08-23')

DatetimeIndex(['2023-08-23'], dtype='datetime64[ns]', freq='D')

In [72]:
#Q.8
dt = pd.to_datetime('2023-08-12')

In [73]:
td = pd.Timedelta(days = 2 ,hours = 1,minutes = 20)

In [74]:
dt-td

Timestamp('2023-08-09 22:40:00')

In [76]:
#Q.9 
df4 = pd.read_csv('titanic.csv')

In [78]:
df4.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [80]:
pd.Categorical(df4)

['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', ..., 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
Length: 12
Categories (12, object): ['Age', 'Cabin', 'Embarked', 'Fare', ..., 'Sex', 'SibSp', 'Survived', 'Ticket']

In [81]:
#Q.10
df5 = pd.read_csv('titanic.csv')

In [82]:
df5

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [83]:
df5['Fare']

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64

In [121]:
#Q.11
student_data = [['Student ID','Test Score'],
            [ 1,85]
             [ 2,90]
             [ 3,80]
              4,75
              5,85
              6,82
              7,78
              8,85
              9,90
              10,85]]

SyntaxError: invalid syntax. Perhaps you forgot a comma? (3355405778.py, line 3)